"""
Task 3: Счастливый билет
Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд
и получали билет с номером. Счастливым билетом называют такой билет с
шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется
написать программу, которая проверяет счастливость билета.
Входные данные
Пользователь вводит одно целое число N (0 ≤ N < 10 ** 6).

Выходные данные
Нужно вывести «YES», если билет с номером N счастливый и «NO» в противном
случае.
"""
