"""
Task 4: Мини-практика
Вам необходимо самостоятельно решить, для какого задания какой оператор
ветвления лучше использовать: if или тернарный.

в Python есть тернарный оператор, вида
<expression-1> if <condition> else <expression-0>
то есть
result = x * 10 if x < 10 else x / 10

1. Запросить у пользователя его возраст и определить, кем он является: ребенком (0–2),
подростком (12–18), взрослым (18_60) или пенсионером (60– ...).

"Тернарный"

2. Запросить у пользователя число от 0 до 9 и вывести ему спецсимвол, который расположен
на этой клавише (1–!, 2–@, 3–# и т. д).

"Тернарный"

3. Запросить у пользователя трехзначное и число и проверить, есть ли в нем одинаковые цифры.

"Тернарный"

4. Запросить у пользователя год и проверить, високосный он или нет. Високосный год либо
кратен 400, либо кратен 4 и при этом не кратен 100.

"Тернарный"

5. Запросить у пользователя пятиразрядное число и определить, является ли  оно палиндромом.

"If"

6. Написать конвертор валют. Пользователь вводит количество USD, выбирает, в какую валюту
хочет перевести: EUR, UAH или AZN, и получает в ответ соответствующую сумму.

"If"

7. Запросить у пользователя сумму покупки и вывести сумму к оплате со скидкой: от 200 до 300
– скидка будет 3%, от 300 до 500 – 5%, от 500 и выше – 7%.

"If"

8. Запросить у пользователя длину окружности и периметр квадрата. Определить, может ли такая
окружность поместиться в указанный квадрат.

"If"

9. Задать пользователю 3 вопроса, в каждом вопросе по 3 варианта ответа. За  каждый правильный
ответ начисляется 2 балла. После вопросов выведите пользователю количество набранных баллов.

"If"

10. Запросить дату (день, месяц, год) и вывести следующую за ней дату. Учтите возможность
перехода на следующий месяц, год, а также високосный год

"If"
"""
