"""
Task 4:
Создать массив «Список покупок». Каждый элемент массива является объектом, который содержит название продукта, необходимое количество и куплен или нет. 
Написать несколько функций для работы с таким массивом.
  1. Вывод всего списка на экран таким образом, чтобы сначала шли некупленные продукты, а потом – купленные.
  2. Добавление покупки в список. Учтите, что при добавлении покупки с уже существующим в списке продуктом, необходимо увеличивать количество в 
  существующей покупке, а не добавлять новую.
  3. Покупка продукта. Функция принимает название продукта и отмечает его как купленный.
"""